//Constructor methods

Object.assign() //создает новый объект путем копирования значений всех собственных перечислимых свойств из одного или более в исходный объект
Object.create() //создает новый объект с указанным объектом прототипа и свойствами
Object.defineProperty() //Добавляет к объекту именованное свойство, описываемые переданными дескрипторами
Object.defineProperties() //Добавляет к объекту именованные свойства, описываемые переданными дескрипторами
Object.freeze() //Замораживает объект, другой код не сможет изменить или удалить никакое свойство
Object.getOwnPropertyDescriptor() //Возвращает дескриптор свойства для именованного свойства объекта
Object.getOwnPropertyNames() // Возвращает массив, содержащий имена всех переданных объекту собственных перечисляемых и неперечисляемых свойств
Object.getOwnPropertySymbols() //Возвращает массив всех символьных свойств найденных непосредственно в переданном объекте
Object.getPrototypeOf() //Возвращает прототип указанного объекта
Object.is() //Определяет являются ли два значения различимыми т.е одинаковыми
Object.isExtensible() //Определяет, разрешено ли расширение объекта
Object.isFrozen() //Определяет, был ли заморожен объект
Object.isSealed() //Определяет, является ли объект запечатанным
Object.keys() //Возвращает массив, содержащий имена всех собственных перечисляемых свойств переданного объекта
Object.preventExtensions() //Предотвращает любое расширение объекта
Object.seal() //Предотвращает удаление свойств объекта другим кодом
Object.setPrototypeOf() //Устанавливает прототип, т.е внутри свойства [[Prototype]]
Object.values() //Возвращает массив значений из объекта
